<template>
	<view class="wrap">
		<div class="content">
			<div class="article">
				<p class="paragraph">
					北京协和医疗信息技术有限责任公司（以下简称“协和医疗信息”）系北京协和百年文创（以下简称“百年文创”）的信息平台运营主体。我们非常重视保护用户（以下简称“您”）的个人信息和隐私。您在使用百年文创小程序服务时，我们会收集、使用、保存、共享您的相关个人信息。为呈现我们处理您个人信息的情况，我们特制定《北京协和百年文创隐私政策》（以下简称“隐私政策”），我们承诺严格按照本隐私政策处理您的个人信息。
				</p>
				<p class="paragraph">
					我们在此提醒您：
				</p>
				<p class="paragraph">
					在您使用百年文创小程序服务前，请您务必认真阅读本隐私政策，充分理解各条款内容，包括但不限于免除或限制我们责任的条款。您知晓并确认，当您勾选“同意”本隐私政策且使用或继续使用百年文创小程序服务，就表示您同意我们按照本隐私政策处理您的个人信息。
				</p>
				<p class="paragraph">
					本隐私政策将帮助您了解以下内容：
				</p>
				<p class="subject">
					一、我们如何收集和使用您的个人信息
				</p>
				<p class="subject">
					二、我们如何保存您的个人信息
				</p>
				<p class="subject">
					三、我们如何共享、披露您的个人信息
				</p>
				<p class="subject">
					四、我们如何保护您的个人信息
				</p>
				<p class="subject">
					五、您如何管理您的个人信息
				</p>
				<p class="subject">
					六、我们如何处理未成年人的个人信息
				</p>
				<p class="subject">
					七、本隐私政策如何更新
				</p>
				<p class="subject">
					八、如何联系我们
				</p>
				
				<p class="subject">
					一、我们如何收集和使用您的个人信息
				</p>
				<p class="paragraph">
					在您使用百年文创小程序服务的过程中，我们会按照如下方式收集和使用您的个人信息，以向您提供我们的产品或服务、优化我们的产品或服务的质量以及保障产品或服务的安全与稳定运行：
				</p>
				<p class="subject">
					1.完成注册
				</p>
				<p class="paragraph">
					当您注册百年文创小程序服务时，我们可能需要收集您的手机号码用以注册验证。您也可以授权我们收集您在第三方平台的账号（openID)、头像、昵称、手机号，以通过第三方平台的账号注册授权登录并同时注册我们的账户。我们收集上述信息是为了帮助您完成注册及使用我们的服务。如您不同意我们收集这类信息，可能导致您将无法正常使用我们的部分或全部服务。
				</p>
				<p class="subject">
					2.使用充电服务
				</p>
				<p class="paragraph">
					当您使用百年文创小程序服务，我们需要收集您的订单信息、交易状态、手机号码、收货地址。我们收集上述信息是为了向您提供百年文创小程序服务及保障我们的交易安全。如您不同意我们收集这类信息，您将无法正常使用我们的服务。同时，我们还将收集您的【浏览记录、交易习惯】信息，以更好地为您展示具有针对性的产品、服务信息或个性化的第三方推广信息，提升您的用户体验，但您不同意我们收集上述信息或选择不接收我们为您定向提供的信息，不影响您正常使用我们的百年文创小程序服务。
				</p>
				<p class="subject">
					3.保障服务的安全性和可靠性
				</p>
				<p class="paragraph">
					为了保障服务的安全性和可靠性，我们将收集您的设备型号、IP地址、设备软件版本信息，以用于保障服务及设备运行安全、客户服务、安全防范、诈骗监测、存档和备份用途。如您不同意我们收集这类信息，您的账户可能会面临较高的安全风险。
				</p>
				<p class="subject">
					4.客户服务
				</p>
				<p class="paragraph">
					在您通过我们的客服人员、问卷调查或其他渠道向我们提出投诉、建议或进行反馈时，为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果，我们可能会收集您与我们的通信或通话记录、您提供的账号信息、订单信息、您提供的联系方式信息、您为了证明相关事实提供的信息。如您不提供上述信息，您的投诉、建议和反馈可能无法得到及时、有效处理，但不影响您正常使用我们的充电服务。
				</p>
				<p class="subject">
					二、我们如何保存您的个人信息
				</p>
				<p class="paragraph">
					我们将在本政策载明的目的所需及法律要求的最短保存期限之内，保存您的个人信息。前述期限届满后，我们将对您的个人信息做删除或匿名化处理。
					我们将您的个人信息保存在中国境内。如需将您的个人信息传输至中国境外时，我们会另行征求您的同意，并遵守相关法律规定。
				</p>
				<p class="subject">
					三、我们如何共享、披露您的个人信息
				</p>
				<p class="paragraph">
					您同意我们为向您提供百年文创小程序服务，向关联方和合作伙伴共享您的个人信息，包括但不限于：
				</p>
				<p class="paragraph">
					1、向商户、合作的物流公司反共享您订单的收货地址信息；
				</p>
				<p class="paragraph">
					2、向合作伙伴提供用户通过百年文创小程序平台点击该合作伙伴提供的第三方链接的情况，不含手机号等用户隐私信息；
				</p>
				<p class="paragraph">
					我们的关联方与合作伙伴包括第三方支付机构、运营平台商户等。
					我们的关联方或合伙伙伴无权将您的个人信息用于与本隐私政策所载明的目的无关的其他用途；如要改变个人信息的处理目的，他们将另行征得您的授权同意。除非有明确的法律规定，我们不会转让或公开披露您的个人信息。
				</p>
				<p class="subject">
					四、我们如何保护您的个人信息
				</p>
				<p class="paragraph">
					我们非常重视用户个人信息的安全。为此，我们采取了行业通行的数据保护技术与管理措施，例如网络隔离、数据加密、员工访问控制等措施。
					请您知悉，虽然我们采取了合理的措施保护您的信息，但没有任何系统或网络是绝对安全的，我们不对由此产生或与之相关的任何风险、损失或损害等承担责任。
					在不幸发生个人信息安全事件后，我们将按照法律的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。
				</p>
				<p class="subject">
					五、您如何管理您的个人信息
				</p>
				<p class="paragraph">
					在您使用百年文创小程序服务期间，您可以访问、更正、删除您的个人信息，以及改变授权同意的范围或注销账号，您的意见会及时得到处理。
				</p>
				<p class="subject">(一)访问及更正您的个人信息</p>
				<p class="paragraph">
					如您希望访问或更正您的信息，例如手机号码，您可在百年文创小程序平台页面点击：“头像”/“我的”，根据相关提示操作，或联系客服予以协助。
				</p>
				<p class="subject">
					(二)删除您的个人信息
				</p>
				<p class="paragraph">
					在以下情形中，您可以向我们提出删除个人信息的请求：
				</p>
				<p class="indent">
					（1）如果我们违反法律或与您的约定收集、使用个人信息的；
				</p>
				<p class="indent">
					（2）如果我们违反法律或与您的约定向第三方共享或转让您的个人信息，我们将立即停止共享、转让行为，并通知第三方及时删除；
				</p>
				<p class="indent">
					（3）如果我们违反法律或与您的约定，公开披露您的个人信息，我们将立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息；
				</p>
				<p class="indent">
					（4）如果您不再使用我们的产品或服务，或您注销了账号，或我们终止服务及运营。
				</p>
				<p class="paragraph">
					当我们接受您的删除请求后，因为相关法律要求或安全技术的限制，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并将其与任何进一步处理隔离，直到备份可以清除或实现匿名。
				</p>
				<p class="subject">
					(三)改变您授权同意的范围
				</p>
				<p class="paragraph">
					您可以通过开启或关闭您设备的相应功能以及通过本隐私政策载明的方式与我们联系，以改变同意范围或撤回您的授权。
					请您理解，百年文创小程序服务可能需要开启部分权限并收集必要的个人信息才能得以实现。当您撤回您的同意时，我们将无法继续为您提供撤回同意所对应的服务，但不会影响此前基于您的授权而开展的个人信息处理服务。
				</p>
				<p class="subject">
					(四)注销账户
				</p>
				<p class="paragraph">
					如果您希望注销您的账户，您可以通过程序内设的注销账户功能提出申请，或通过本隐私政策载明的方式与我们联系，我们将及时响应您的请求。如您的账户符合《百年文创小程序服务协议》及其附属协议、规则关于注销账户的条件，我们会为您提供注销服务。
				</p>
				<p class="paragraph">
					您注销上述账户的行为是不可逆的，我们将停止为您提供产品或服务，不再收集您的个人信息，并根据法律的要求删除与您账户相关的个人信息或作匿名化处理。
				</p>
				<p class="subject">
					(五)响应您的上述请求
				</p>
				<p class="paragraph">
					如您无法按照上述方式行使权利的，您可以采取本隐私政策载明的联系方式与我们联系。我们会在接到您申请行使权利要求后15个工作日内完成对您申请核查和处理。为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
					对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。
				</p>
				<p class="subject">
					(六)响应情形的例外
				</p>
				<p class="paragraph">
					在以下情形中，我们将无法响应您的请求:
				</p>
				<p class="indent">
					（1）与我们履行法律规定的义务相关的;
				</p>
				<p class="indent">
					（2）与国家安全、国防安全直接相关的;
				</p>
				<p class="indent">
					（3）与公共安全、公共卫生、重大公共利益直接相关的;
				</p>
				<p class="indent">
					（4）与犯罪侦查、起诉、审判和执行判决等直接相关的;
				</p>
				<p class="indent">
					（5）我们有充分证据表明个人信息主体存在主观恶意或滥用权利的;
				</p>
				<p class="indent">
					（6）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的;
				</p>
				<p class="indent">
					（7）响应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益受到严重损害的;
				</p>
				<p class="indent">
					（8）涉及商业秘密的。
				</p>
				<p class="subject">
					六、我们如何处理未成年人的个人信息
				</p>
				<p class="paragraph">
					我们非常重视对未成年人个人信息的保护。由于百年文创小程序未收集用户的年龄信息，若您是18周岁以下的未成年人，在使用我们的服务前，应事先取得您的监护人的书面同意。我们将根据国家相关法律保护未成年人的个人信息。
					对于经监护人同意而收集未成年人个人信息的情况，我们只会在法律允许和保护未成年人所必要的情况下使用或公开披露此信息。
					如果有事实证明我们在未事先获得可证实的监护人同意的情况下收集了未成年人的个人信息，我们在知晓后会设法尽快删除相关信息。
				</p>
				<p class="subject">
					七、本隐私政策如何更新
				</p>
				<p class="paragraph">
					本隐私政策可能会适时发生变更。我们会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知（我们可能会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。
				</p>
				<p class="subject">
					未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。
				</p>
				<p class="paragraph">
					本隐私政策所指的重大变更包括但不限于:我们的服务模式发生重大变化；个人信息共享、转让或公开披露的主要对象发生变化；您参与个人信息处理方面的权利及其行使方式发生重大变化；我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化；个人信息安全影响评估报告表明存在高风险时。我们还会将本隐私政策的旧版本存档，供您查阅。
				</p>
				<p class="subject">
					八、如何联系我们
				</p>
				<p class="paragraph">
					如果您对本隐私政策或个人信息保护有任何问题，请通过程序内设的投诉/意见反馈功能提出意见或申请，或平台客服咨询。
					一般情况下，我们将在十五天内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以向网信、电信、公安及工商等监管部门进行投诉或举报。
				</p>
			</div>
			<!-- <button v-if="show" :disabled="disabled" @click="getReturn">
				{{timeNum}} 完成
			</button> -->
		</div>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				timer:null,
				timeNum:6,
				disabled:true,
				show:false
			}
		},
		onShow(){
			var url =getCurrentPages()[getCurrentPages().length-2].route;
			console.log(url);
			if(url=='pages/my/set/set'){
				return false;
			}else {
				this.show = true;
				this.timer = setInterval(()=>{
					this.timeNum--;
					if(this.timeNum===0){
						this.timeNum = '';
						this.disabled = false;
						clearInterval(this.timer)
					}
				},1000)
			}
		},
		onLoad(){
			// this.timer = setInterval(()=>{
			// 	this.timeNum--;
			// 	if(this.timeNum===0){
			// 		this.timeNum = '';
			// 		this.disabled = false;
			// 		clearInterval(this.timer)
			// 	}
			// },1000)
		},
		methods: {
			getReturn(){
				uni.setStorageSync('userAgreement',true);
				uni.navigateBack({
					delta:1
				})
			}
		}
	}
</script>

<style scoped>
	.wrap{
		background: #fff!important;
	}
	.wrap .content .title{
		text-align: center;
	}
	.article{
		padding:10rpx 20rpx;
		font-size: 26rpx;
	}
	.article .paragraph{
		text-indent: 20rpx;
		line-height: 1.5;
	}
	.article .subject{
		font-weight: bold;
		padding: 10rpx 0;
	}
	.article .indent{
		text-indent: 40rpx;
	}
</style>
