<template>
	<view class="wrap">
		<div class="content">
			<h3 class="title">百年文创小程序服务协议</h3>
			<div class="article">
				<p class="paragraph">《百年文创小程序服务协议》（以下简称“用户协议”或“本协议”）由用户（以下或称“您”）与北京协和医疗信息技术有限责任公司（以下简称“我们”或者“我司”）依据本协议约定的方式订立，用于明确在您使用我们提供的产品或服务时，双方之间的权利义务关系。
				本协议一经订立，将在您与我们之间产生合同上的法律效力。郑重提示您，请您审慎阅读并充分理解本协议全部条款，特别是其中所涉及的免除或限制我司的义务与责任的条款、排除或限制用户权利的条款等，以及以粗体字样标识的内容。当您点击确认本协议，使用百年文创小程序服务，即视为您理解并同意本协议的相关约定，同意本协议对您和我司均具有法律约束力。如您不同意本协议，请立即停止注册或使用百年文创小程序的服务。
				如您对协议有任何疑问，可向百年文创小程序平台客服咨询。</p>
				<p class="paragraph">您在使用本平台点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容。尤其是涉及用户重大权益的加粗部分的文字，您应重点阅读。本用户协议不仅针对用户注册时，而是在您每次使用前均需要同意。如您对协议有任何疑问，可向百年文创小程序平台客服咨询。</p>
				<p class="subject">
					一、服务条款的确认与接受
				</p>
				<p class="paragraph">1.当您按照百年文创小程序平台（以下简称“本平台“的页面提示填写完成全部信息、充分阅读、理解并同意本协议的全部内容，
				当您点击确认本协议，使用百年文创小程序服务，即视为您理解并同意本协议的相关约定，同意本协议对您和我司均具有法律约束力。</p>
				<p class="paragraph">2.根据国家法律法规变化及本平台运营需要，我司有权对本服务条款及相关规则不定期进行修改，用户协议变更方式参见本协议第十四条。
				用户协议一旦发生变动，将在本平台公布修改内容，一经公布或自生效日期起，即有效代替原来的用户协议。用户应不时关注本服务条款的更新，如不接受更新后的条款，应立即停止使用本平台。用户继续使用本平台将被视为接受修改后的条款。</p>
				<p class="paragraph">
					3.除本协议以外，我们已经发布的或将来可能发布的有关我司向您提供服务的协议、服务规则、政策、须知等内容，均视为本协议的补充协议，作为本协议不可分割的组成部分，与本协议具有同等法律效力。请您及时关注并阅读前述相关补充协议。相关补充协议的部分或全部条款被认定无效的，不影响其它协议或协议条款的效力。
				</p>
				<p class="subject">二、定义</p>
				<p class="paragraph">在本协议中，除非上下文有其他的规定，下列表达应作如下解释：</p>
				<p class="paragraph">1.百年文创小程序平台：北京协和百年文创微信小程序平台。</p>
				<p class="paragraph">2.我司：指百年文创小程序平台的技术支持，即北京协和医疗信息技术有限责任公司。</p>
				<p class="paragraph">3.用户：指具有完全民事行为能力的百年文创小程序平台各项服务的使用者。</p>
				<p class="paragraph">4.认证用户：指与我司签订本协议并完成注册流程的用户。一个认证用户仅可以拥有一个我司账户，每个账户对应唯一的用户名（即用户ID）。</p>
				<p class="subject">三、用户注册与认证</p>
				<p class="paragraph">1.用户资格</p>
				<p class="indent">
					（1）您确认，在您开始用户认证程序从而具备使用我司共享平台服务的资格前，您应具备中华人民共和国法律规定的与您行为相适应的民事权利能力与民事行为能力。
				</p>
				<p class="indent">
					（2）若您不具备前述与您行为相适应的民事权利能力与民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
				</p>
				<p class="paragraph">2.账户说明</p>
				<p class="indent">
					（1）您作为访客通过第三方账户授权登录后，您即为本平台的用户并拥有自己的账户，您可通过账户扫码使用本应用。具体注册及登录方式以本平台实际提供的为准。
				</p>
				<p class="paragraph">
					（2）百年文创账户的所有权归百年文创小程序所有，用户完成申请注册后，仅获得百年文创账户的使用权。
					为便于用户使用我司服务，你可以使用我司认可的第三方账户授权登录本平台，若您使用第三方账户授权登录本平台，则视为您同意我司向该第三方收集您的必要个人信息（具体信息内容以授权页面提示为准），如您不同意我司收集这些信息，请不要使用该第三方账户登录。
				</p>
				<p class="paragraph">3.认证信息管理</p>
				<p class="indent">
					（1）在用户认证过程中，您应按本平台页面的提示准确、真实、完整地提供您的信息，您了解并同意，您有义务保持您提供信息的真实性及有效性。
					在注册后，如发现您以虚假信息骗取注册，我司有权不经通知单方采取限期改正、删除资料、暂停使用、注销、收回账户并终止对您提供部分或全部服务等措施。我司对因此造成的服务暂停、终止不承担任何责任，您应当承担一切不利后果。如因此给我司造成损失的，您应当承担相应的责任。
				</p>
				<p class="indent">
					（2）如果您的认证信息有所变更，您应当及时更新您提供的信息，我司将依法不时地对您的信息进行检查核实，您应当配合提供最及时、真实、完整的信息。
					用户在成功注册账户后，即可按照我司平台相关规则购买平台商品。上述用户认证的审核和通过均由我司最终决定。
					我司可以根据用户上传的文件对其文件的真实性、合法性进行合理的质询和怀疑，并给予用户不通过认证的结果，而无需说明任何原因；用户可根据操作提示重新认证。
				</p>
				<p class="subject">四、用户使用规则</p>
				<p class="paragraph">1.用户在成为本平台的用户后，应采取合理措施确保账户的安全，
				用户对基于其账号下发生的行为承担责任。</p>
				<p class="paragraph">
					2.用户在使用我司提供的服务时，
					不得利用我司账号或产品、服务制作、复制、发布、传播如下干扰我司运营，以及侵犯其他用户或第三方合法权益的内容：
				</p>
				<p class="indent">
				   （1）反对中华人民共和国宪法所确定的基本原则的；
				</p>
				<p class="indent">
					(2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
				</p>
				<p class="indent">
				   （3）损害国家荣誉和利益的；
				</p>
				<p class="indent">
				   （3）损害国家荣誉和利益的；
				</p>
				<p class="indent">
				   (4)煽动民族仇恨、民族歧视，破坏民族团结的；
				</p>
				<p class="indent">
				   （5）破坏国家宗教政策，宣扬邪教和封建迷信的；
				</p>
				<p class="indent">
				   （6）散布谣言，扰乱社会秩序，破坏社会稳定的；
				</p>
				<p class="indent">
				   （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
				</p>
				<p class="indent">
				   （8）侮辱或者诽谤他人，侵害他人合法权益的；
				</p>
				<p class="indent">
				   （9）侵犯他人的肖像权、隐私权、商业秘密或其他任何合法权益的；
				</p>
				<p class="indent">
				   （10）含有法律、行政法规禁止的其他内容的。
				</p>
				<p class="paragraph">
					3.您在使用百年文创小程序的服务时，必须遵守中华人民共和国相关法律法规及本协议的规定，不得利用百年文创小程序的服务从事任何违法违规或可能违反本协议的活动。您不得利用百年文创小程序从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动，不得干扰本平台的正常运转，不得侵入本平台及国家计算机信息系统。
					如您违反相关法律法规或本协议规定，对我司或任何第三方合法权益的损害，您应当承担全部的责任。
					用户应遵守本协议
					、相关的服务协议及《百年文创小程序服务隐私政策》
					的各项条款，正确、适当地使用本服务，如因用户违反本条款中的任何条款，我司有权在通知用户后
					对用户采取包括但不限于暂停使用、限制使用、终止服务、回收账户、追究法律责任等措施。
				</p>
				<p class="subject">七、个人信息保护</p>
				<p class="paragraph">
					本公司重视对用户个人信息的保护。《百年文创小程序服务隐私政策》呈现了百年文创小程序将如何收集、使用、保存、共享及保护您的信息，详情请参阅《百年文创小程序服务隐私政策》。
				</p>
				<p class="subject">八、账号注销</p>
				<p class="paragraph">1.如用户账户存在以下情形，我司有权要求您限期改正、删除相关信息、暂停使用、直至注销您的账户：</p>
				<p class="indent">
					（1）用户提交的注册信息不真实、准确、完整，经过我司通知后仍不改正的；
				</p>
				<p class="indent">（2）用户注册账户后，超过【365】日不使用账户；</p>
				<p class="indent">（3）用户不具备相应的民事权利能力和民事行为能力；</p>
				<p class="indent">（4）用户未经我司同意，转让、出售或出借予他人使用该百年文创小程序账户；</p>
				<p class="indent">（5）用户利用百年文创小程序从事违反法律的活动；</p>
				<p class="indent">（6）用户违反本协议及相关协议和规则中规定的条款；</p>
				<p class="indent">（7）法律规定或有权机关的要求。</p>
				<p class="paragraph">2.如用户向百年文创小程序提出账户注销申请，经核实存在以下情形的，我司有权拒绝用户的注销申请：</p>
				<p class="indent">（1）账户有余额；</p>
				<p class="indent">（2）账户有尚未完成的交易；</p>
				<p class="indent">（3）账户有正在进行的操作（如申请找密码、修改手机号等）；</p>
				<p class="indent">（4）用户存在违反本协议或相关规则的行为；</p>
				<p class="indent">（5）其他不符合注销账户的情形。</p>
				<p class="paragraph">3.用户注销账户的，应按照我司要求的程序提出申请，并按照我司的要求核实身份信息等，经过我司审核通过后，可予以注销。</p>
				<p class="paragraph">4. 用户已充分知晓并确认，账户注销后，用户将不再拥有账户相关的权益，包括但不限于：</p>
				<p class="indent">（1）账户注销后，用户将无法再继续通过其我司账户使用相关服务，无法再享受我司账户中的相关权益，且不可恢复；</p>
				<p class="indent">（2） 账户注销后，我司不再向用户提供账户信息、交易记录、历史订单等数据的查询服务，相关法律法规另有规定的除外。我司将在符合法律法规及本协议约定的前提下保留、删除相关信息。</p>
				<p class="paragraph">5. 因注销账户所带来的不便或不利后果，由用户自行承担。</p>
				<p class="subject">五、知识产权声明及软件使用规范</p>
				<p class="paragraph">1.除非另有特别声明，我司提供本服务时所依托的硬件、软件的著作权、专利权及其他知识产权均归我司所有，
				我司提供服务的过程中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权均归我司所有。</p>
				<p class="paragraph">2.除非法律允许或我司的书面许可，用户使用本平台过程中不得从事下列行为：</p>
				<p class="indent">（1）删除本平台及其副本上关于著作权的信息；</p>
				<p class="indent">（2）对本平台进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本平台的源代码；</p>
				<p class="indent">（3）对我司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p>
				<p class="indent">
					（4）对本平台或者本平台运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本平台运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经我司授权的第三方工具/服务接入本平台和相关系统；
				</p>
				<p class="indent">
					（5）通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
				</p>
				<p class="indent">
					（6）通过非我司开发、授权的第三方软件、插件、外挂、系统，登录或使用本平台及服务，或制作、发布、传播上述工具；
				</p>
				<p class="indent">
					（7）自行或者授权他人、第三方软件对本平台及其组件、模块、数据进行干扰。
				</p>
				<p class="subject">
					六、商业活动
				</p>
				<p class="paragraph">
					您理解并接受，我们可以在提供服务时进行下述商业活动：向您推荐或展示您可能感兴趣的产品、服务信息，或者通过系统向您展示个性化的第三方推广信息。如在本平台页面向您推送消息通知、给您发送推广短信等。若您不希望收到相关信息，可联系我司客服进行退订。
				</p>
				<p class="subject">七、用户行为风险评估及处理</p>
				<p class="paragraph">
					您理解并接受，为了向用户提供更加优质的服务，且为维持市场正常运营秩序，我司有权对认证用户使用本协议所提供的服务的行为，进行风险评估，并根据评价结果增减该认证用户使用服务的费用，或根据评价结果自行决定是否向用户提供服务。
				</p>
				<p class="subject">
					八、违约认定及风险自担
				</p>
				<p class="paragraph">
					1.发生如下情形之一的，视为用户违约：
				</p>
				<p class="indent">
					（1）如我司在用户认证信息复核过程中发现用户提供的认证信息不全、无效或虚假；
				</p>
				<p class="indent">
					（2）如用户发生危及交易安全或账户安全的行为；
				</p>
				<p class="indent">
					（3）如用户采用不正当手段谋取利益的行为，包括向我司工作人员及/或其关联人士提供财物、消费、款待或商业机会，或通过其他手段谋取不正当利益；
				</p>
				<p class="indent">
					（4）如用户扰乱我司、本平台，以任何方式，刻意规避我司、本平台的各类规则或市场管控措施，或以不正当的方式获取、使用我司、本平台平台资源的行为；
				</p>
				<p class="indent">
					（5）如用户违反中国相关法律法规的规定；
				</p>
				<p class="indent">
					（6）如用户违反本协议或相关服务协议的其他规定。
				</p>
				<p class="paragraph">
					2.在适用法律允许的范围内，我司有权随时自行决定暂停、终止、修改服务，或对部分用户暂停、终止、修改服务，且毋须另行通知。
				</p>
				<p class="paragraph">
					3.我司将按现有技术水平，尽力促使我司服务的正确、持续、及时和安全，但在法律法规允许的最大范围内，不就此负担任何明示或默示的保证责任。您同意承担使用我司服务的所有风险及因该风险可能造成的任何损害，我司对于您所使用的各项服务或无法使用各项服务所导致的任何直接、间接、衍生或特别的损害，包括但不限于商业利润的损失、贸易的中断、信息或数据的丢失，都不负任何赔偿责任，即使我司已被告知存在这种损害的可能性也不例外。若因服务器、通信网络和移动智能终端的软硬件故障、电信部门技术调整、计算机病毒、恶意攻击及其他不可预测的因素而受到影响，造成您无法正常使用我司的服务，不承担任何责任。尽管有前述约定，我们将采取合理行动促使服务恢复正常。
				</p>
				<p class="subject">
					九、法律责任
				</p>
				<p class="paragraph">
					1.用户理解并同意，我司有权依合理判断对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
				</p>
				<p class="paragraph">
					2.用户理解并同意，因用户违反本条款约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿我司与合作公司、关联公司，并使之免受损害。
				</p>
				<p class="subject">
					十、通知
				</p>
				<p class="paragraph">
					您同意我司以以下合理的方式向您送达各类通知：
				</p>
				<p class="indent">
					（1）本平台公示的文案；
				</p>
				<p class="indent">
					（2）站内短信、本平台弹出、推送的消息；
				</p>
				<p class="indent">
					（3）根据您预留于百年文创小程序服务平台的联系方式发出的电子邮件、短信、函件等。
				</p>
				<p class="subject">
					十一、协议的变更
				</p>
				<p class="paragraph">
					1.由于互联网的高速发展，我司保留不经事先通知为维修、升级或其他目的暂停或更改本服务任何部分的权利。
				</p>
				<p class="paragraph">
					2.我司可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议、补充协议及隐私政策，变更后的协议、补充协议、隐私政策（下称“变更事项”）将通过法定程序并以本协议第十条约定的方式通知您。
				</p>
				<p class="paragraph">
					3.如您不同意变更事项，您有权于变更事项确定的生效日前联系我司反馈意见。如反馈意见得以采纳，我司将酌情调整变更事项。
					如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用本平台服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用本平台服务，则视为您同意已生效的变更事项。
				</p>
				<p class="subject">
					十二、协议的终止
				</p>
				<p class="paragraph">
					1.用户发起的终止
				</p>
				<p class="paragraph">
					您有权通过以下任一方式终止本协议：
				</p>
				<p class="indent">
					（1）您不再继续使用本平台服务：
				</p>
				<p class="indent">
					（2）变更事项生效前您停止使用并明示不愿接受变更事项的。
				</p>
				<p class="paragraph">
					2.本公司发起的终止
				</p>
				<p class="paragraph">
					出现以下情况时，我司可以本协议第十条的所列的方式通知您终止本协议：出现以下情况时，我司可以本协议第十条的所列的方式通知您终止本协议：
				</p>
				<p class="indent">
					（1）您违反本协议约定，我司依据违约条款终止本协议的；
				</p>
				<p class="indent">
					（2）您的用户行为存在异常，我司合理怀疑您可能存在违反本协议约定的行为，如果不终止本协议则可能对我司或本平台或其他用户造成不利影响的；
				</p>
				<p class="indent">
					（3）您盗用他人账户、发布违禁信息、骗取他人财物、采取不正当手段谋利等行为，我司依据本协议对您的账户予以查封的；
				</p>
				<p class="indent">
					（4）除上述情形外，因您多次违反本平台相关规定且情节严重，我司依据本协议对您的账户予以查封的；
				</p>
				<p class="indent">
					（5）您停止使用账户达365天；
				</p>
				<p class="indent">
					（6）其他应当终止服务的情况。
				</p>
				<p class="paragraph">
					3.协议终止后的处理
				</p>
				<p class="paragraph">
					本协议终止后，除法律有明确规定外，我司无义务向您或您指定的第三方披露您账户中的任何信息。本协议终止后，我司仍享有下列权利：
				</p>
				<p class="indent">
					（1）在法律法规规定的期限内继续保存您留存于我司的各类信息；
				</p>
				<p class="indent">
					（2）对于您过往的违约行为，我司仍可依据本协议向您追究违约责任。
				</p>
				<p class="subject">
					十三、管法律辖适用及其他
				</p>
				<p class="paragraph">
					本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；
					协商不成时，任何一方均可向协议签订地人民法院提起诉讼。本协议签订地为杭州市余杭区。
				</p>
				<p class="paragraph">
					2.如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
				</p>
				<p class="paragraph">
					3.本协议未明示授权的其他权利仍由我司保留，用户在行使这些权利时须另外取得我司的书面许可。我司如果未行使前述任何权利，并不构成对该权利的放弃。
					【审慎提醒】如您选择点击“同意”本协议，并完成注册，本协议将立即生效，并构成您与我司之间有约束力的法律文件。
				</p>
				
			</div>
		<!-- 	<button v-if="show" :disabled="disabled" @click="getReturn">
				{{timeNum}} 完成
			</button> -->
		</div>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				timer:null,
				timeNum:6,
				disabled:true,
				show:false
			}
		},
		watch:{
			// timeNum(val, oldVal){
				
			// }
		},
		onShow(){
			var url =getCurrentPages()[getCurrentPages().length-2].route;
			console.log(url);
			if(url=='pages/my/set/set'){
				return false;
			}else {
				this.show = true;
				this.timer = setInterval(()=>{
					this.timeNum--;
					if(this.timeNum===0){
						this.timeNum = '';
						this.disabled = false;
						clearInterval(this.timer)
					}
				},1000)
			}
		},
		onLoad(){
			
		},
		methods: {
			getReturn(){
				uni.setStorageSync('serverAgreement',true);
				uni.navigateBack({
					delta:1
				})
			}
		}
	}
</script>

<style scoped>
	.wrap{
		background: #fff!important;
	}
	.wrap .content .title{
		text-align: center;
	}
	.article{
		padding:10rpx 20rpx;
		font-size: 26rpx;
	}
	.article .paragraph{
		text-indent: 20rpx;
		line-height: 1.5;
	}
	.article .subject{
		font-weight: bold;
		padding: 10rpx 0;
	}
	.article .indent{
		text-indent: 40rpx;
	}
</style>
